In [11]:
import pandas as pd

df = pd.DataFrame({
    "이름": ["철수", "영희", "민수", "지현", "수빈", "현우", "하늘"],
    "국어": [85, 90, 70, 95, 100, 65, 80],
    "영어": [78, 88, 82, 90, 85, 70, 95],
    "수학": [92, 85, 60, 98, 90, 75, 88]
})
df

   이름   국어  영어  수학
0  철수   85  78  92
1  영희   90  88  85
2  민수   70  82  60
3  지현   95  90  98
4  수빈  100  85  90
5  현우   65  70  75
6  하늘   80  95  88

In [2]:
df.head(3)

   이름  국어  영어  수학
0  철수  85  78  92
1  영희  90  88  85
2  민수  70  82  60

In [3]:
df.tail(3)

   이름   국어  영어  수학
4  수빈  100  85  90
5  현우   65  70  75
6  하늘   80  95  88

In [4]:
df.sample(3)

   이름   국어  영어  수학
4  수빈  100  85  90
3  지현   95  90  98
5  현우   65  70  75

In [5]:
df.shape

(7, 4)

행과 컬럼

In [12]:
df.describe()

               국어         영어         수학
count    7.000000   7.000000   7.000000
mean    83.571429  84.000000  84.000000
std     12.817399   8.266398  12.714821
min     65.000000  70.000000  60.000000
25%     75.000000  80.000000  80.000000
50%     85.000000  85.000000  88.000000
75%     92.500000  89.000000  91.000000
max    100.000000  95.000000  98.000000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   국어      7 non-null      int64
 2   영어      7 non-null      int64
 3   수학      7 non-null      int64
dtypes: int64(3), object(1)
memory usage: 356.0+ bytes

In [15]:
df.corr(numeric_only=True)

          국어        영어        수학
국어  1.000000  0.550555  0.772121
영어  0.550555  1.000000  0.418626
수학  0.772121  0.418626  1.000000

In [16]:
df_class = pd.DataFrame({
    "이름": ["철수","영희","민수","지현","수빈","현우","하늘"],
    "학급": ["A","A","B","B","A","C","C"],
    "성별": ["M","F","M","F","F","M","F"]
})

In [17]:
df

   이름   국어  영어  수학
0  철수   85  78  92
1  영희   90  88  85
2  민수   70  82  60
3  지현   95  90  98
4  수빈  100  85  90
5  현우   65  70  75
6  하늘   80  95  88

In [18]:
df_class.nunique()

이름    7
학급    3
성별    2
dtype: int64

In [20]:
df_class['학급'].unique()

array(['A', 'B', 'C'], dtype=object)